MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/adc/implementation_2/hal_ll_adc.c
/****************************************************************************
**
** Copyright (C) 2020 MikroElektronika d.o.o.
** Contact: https://www.mikroe.com/contact
**
** This file is part of the mikroSDK package
**
** Commercial License Usage
**
** Licensees holding valid commercial NECTO compilers AI licenses may use this
** file in accordance with the commercial license agreement provided with the
** Software or, alternatively, in accordance with the terms contained in
** a written agreement between you and The mikroElektronika Company.
** For licensing terms and conditions see
** https://www.mikroe.com/legal/software-license-agreement.
** For further information use the contact form at
** https://www.mikroe.com/contact.
**
**
** GNU Lesser General Public License Usage
**
** Alternatively, this file may be used for
** non-commercial projects under the terms of the GNU Lesser
** General Public License version 3 as published by the Free Software
** Foundation: https://www.gnu.org/licenses/lgpl-3.0.html.
**
** The above copyright notice and this permission notice shall be
** included in all copies or substantial portions of the Software.
**
** THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
** OF MERCHANTABILITY, EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED
** TO THE WARRANTIES FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
** IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
** DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT
** OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE
** OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
**
****************************************************************************/
/*!
 * @file  hal_ll_adc.c
 * @brief Low level HAL ADC source file.
 */

#include "hal_ll_adc.h"
#include "hal_ll_gpio.h"
#include "hal_ll_adc_pin_map.h"

// ------------------------------------------------------------- PRIVATE MACROS

//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!
//Define for the MCU Revision (check the revision of the MCU you are using and uncomment accordingly)
#define RevisionY
// #define RevisionV
//!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!

/*!< @brief Helper macro for getting hal_ll_module_state address */
#define hal_ll_adc_get_module_state_address ((hal_ll_adc_handle_register_t *)*handle)
/*!< @brief Helper macro for getting module specific control register structure base address // first register address */
#define hal_ll_adc_get_handle (hal_ll_adc_handle_register_t *)hal_ll_adc_get_module_state_address->hal_ll_adc_handle
/*!< @brief Helper macro for getting module specific control register structure */
#define hal_ll_adc_get_base_struct(_handle) ((hal_ll_adc_base_handle_t *)_handle)
/*!< @brief Helper macro for getting module specific base address directly from HAL layer handle */
#define hal_ll_adc_get_base_from_hal_handle ((hal_ll_adc_hw_specifics_map_t *)((hal_ll_adc_handle_register_t *)\
                                            (((hal_ll_adc_handle_register_t *)(handle))->hal_ll_adc_handle))->hal_ll_adc_handle)->base
/*!< @brief Helper macro for getting adequate module index number */
#define hal_ll_adc_module_num(_module_num) (_module_num - 1)

#define HAL_LL_ADC_ISR_OFFSET                  ( 0x00 )
#define HAL_LL_ADC_IER_OFFSET                  ( 0x04 / 4 )
#define HAL_LL_ADC_CR_OFFSET                   ( 0x08 / 4 )
#define HAL_LL_ADC_CFGR_OFFSET                 ( 0x0C / 4 )
#define HAL_LL_ADC_CFGR2_OFFSET                ( 0x10 / 4 )
#define HAL_LL_ADC_SMPR1_OFFSET                ( 0x14 / 4 )
#define HAL_LL_ADC_SMPR2_OFFSET                ( 0x18 / 4 )
#define HAL_LL_ADC_PCSEL_OFFSET                ( 0x1C / 4 )
#define HAL_LL_ADC_LTR1_OFFSET                 ( 0x20 / 4 )
#define HAL_LL_ADC_HTR1_OFFSET                 ( 0x24 / 4 )
#define HAL_LL_ADC_SQR1_OFFSET                 ( 0x30 / 4 )
#define HAL_LL_ADC_SQR2_OFFSET                 ( 0x34 / 4 )
#define HAL_LL_ADC_SQR3_OFFSET                 ( 0x38 / 4 )
#define HAL_LL_ADC_SQR4_OFFSET                 ( 0x3C / 4 )
#define HAL_LL_ADC_DR_OFFSET                   ( 0x40 / 4 )
#define HAL_LL_ADC_JSQR_OFFSET                 ( 0x4C / 4 )
#define HAL_LL_ADC_OFR1_OFFSET                 ( 0x60 / 4 )
#define HAL_LL_ADC_OFR2_OFFSET                 ( 0x64 / 4 )
#define HAL_LL_ADC_OFR3_OFFSET                 ( 0x68 / 4 )
#define HAL_LL_ADC_OFR4_OFFSET                 ( 0x6C / 4 )
#define HAL_LL_ADC_JDR1_OFFSET                 ( 0x80 / 4 )
#define HAL_LL_ADC_JDR2_OFFSET                 ( 0x84 / 4 )
#define HAL_LL_ADC_JDR3_OFFSET                 ( 0x88 / 4 )
#define HAL_LL_ADC_JDR4_OFFSET                 ( 0x8C / 4 )
#define HAL_LL_ADC_AWD2CR_OFFSET               ( 0xA0 / 4 )
#define HAL_LL_ADC_AWD3CR_OFFSET               ( 0xA4 / 4 )
#define HAL_LL_ADC_LTR2_OFFSET                 ( 0xB0 / 4 )
#define HAL_LL_ADC_HTR2_OFFSET                 ( 0xB4 / 4 )
#define HAL_LL_ADC_LTR3_OFFSET                 ( 0xB8 / 4 )
#define HAL_LL_ADC_HTR3_OFFSET                 ( 0xBC / 4 )
#define HAL_LL_ADC_DIFSEL_OFFSET               ( 0xC0 / 4 )
#define HAL_LL_ADC_CALFACT_OFFSET              ( 0xC4 / 4 )
#define HAL_LL_ADC_CALFACT2_OFFSET             ( 0xC8 / 4 )
#define HAL_LL_ADC_CSR_OFFSET                  ( 0x300 / 4 )
#define HAL_LL_ADC_CCR_OFFSET                  ( 0x308 / 4 )
#define HAL_LL_ADC_CDR_OFFSET                  ( 0x30C / 4 )
#define HAL_LL_ADC_CDR2_OFFSET                 ( 0x310 / 4 )

#define HAL_LL_ADC_ADCSEL_BIT0                 16
#define HAL_LL_ADC_ADCSEL_BIT1                 17
#define HAL_LL_ADC_CKPERSEL_BIT0               28
#define HAL_LL_ADC_CKPERSEL_BIT1               29

#define HAL_LL_ADC_FIRST_CONV                  6
#define HAL_LL_ADC_SECOND_CONV                 12
#define HAL_LL_ADC_THIRD_CONV                  18
#define HAL_LL_ADC_FOURTH_CONV                 24

#define HAL_LL_ADC12_ENABLE_CLOCK              5
#define HAL_LL_ADC3_ENABLE_CLOCK               24

#define HAL_LL_ADC_ISR_ADRDY                   0x1ul
#define HAL_LL_ADC_ISR_EOSMP                   0x2ul
#define HAL_LL_ADC_ISR_EOC                     0x4ul

#define HAL_LL_ADC_CR_ADEN                     0x1ul
#define HAL_LL_ADC_CR_ADDIS                    0x2ul
#define HAL_LL_ADC_CR_ADSTART                  0x4ul
#define HAL_LL_ADC_CR_JADSTART                 0x8ul
#define HAL_LL_ADC_CR_BOOST                    0x100ul
#define HAL_LL_ADC_CR_ADCALLIN                 0x10000ul
#define HAL_LL_ADC_CR_ADCALDIF                 0x40000000ul
#define HAL_LL_ADC_CR_DEEPPWD                  0x20000000ul
#define HAL_LL_ADC_CR_ADVREGEN                 0x10000000ul
#define HAL_LL_ADC_CR_ADCAL                    0x80000000ul

