MikroElektronika/mikrosdk_v2/targets/arm/mikroe/stm32/src/adc/implementation_2/hal_ll_adc.c
    if ( (pin_check_result = hal_ll_adc_check_pins( hal_ll_adc_hw_specifics_map_local->pin, &index ) ) == HAL_LL_PIN_NC )
    {
        return HAL_LL_ADC_WRONG_PIN;
    };

    hal_ll_adc_init( hal_ll_adc_hw_specifics_map_local );

    hal_ll_module_state[pin_check_result]->hal_ll_adc_handle = (handle_t *)&hal_ll_adc_hw_specifics_map[pin_check_result]->base;
    hal_ll_module_state[pin_check_result]->init_ll_state = true;

    return HAL_LL_ADC_SUCCESS;
}

hal_ll_err_t hal_ll_adc_set_resolution(handle_t *handle, hal_ll_adc_resolution_t resolution)
{
    low_level_handle = hal_ll_adc_get_handle;
    hal_ll_adc_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_adc_get_module_state_address);

    if( low_level_handle->hal_ll_adc_handle == NULL ) {
        return HAL_LL_MODULE_ERROR;
    }

    low_level_handle->init_ll_state = false;

    switch( resolution ) {
        case HAL_LL_ADC_RESOLUTION_8_BIT:
            hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_8BIT_RES;
            break;
        case HAL_LL_ADC_RESOLUTION_10_BIT:
            hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_10BIT_RES;
            break;
        case HAL_LL_ADC_RESOLUTION_12_BIT:
            hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_12BIT_RES;
            break;
        case HAL_LL_ADC_RESOLUTION_14_BIT:
            hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_14BIT_RES;
            break;
        case HAL_LL_ADC_RESOLUTION_16_BIT:
            hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_16BIT_RES;
            break;
        default:
            return HAL_LL_ADC_UNSUPPORTED_RESOLUTION;
    }

    hal_ll_adc_init( hal_ll_adc_hw_specifics_map_local );

    low_level_handle->init_ll_state = true;

    return HAL_LL_ADC_SUCCESS;
}

hal_ll_err_t hal_ll_adc_set_vref_input(handle_t *handle, hal_ll_adc_voltage_reference_t vref_input)
{
    low_level_handle = hal_ll_adc_get_handle;

    if( low_level_handle->hal_ll_adc_handle == NULL ) {
        return HAL_LL_MODULE_ERROR;
    }

    low_level_handle->init_ll_state = false;

    switch( vref_input ) {
        case HAL_LL_ADC_VREF_EXTERNAL:
            break;
        case HAL_LL_ADC_VREF_DEFAULT:
            break;
        default:
            return HAL_LL_ADC_UNSUPPORTED_RESOLUTION;
    }

    hal_ll_adc_init( hal_ll_adc_hw_specifics_map_local );

    low_level_handle->init_ll_state = true;

    return HAL_LL_ADC_SUCCESS;
}

void hal_ll_adc_set_vref_value(handle_t *handle, float vref_value)
{
    low_level_handle = hal_ll_adc_get_handle;
    hal_ll_adc_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_adc_get_module_state_address);

    if( low_level_handle->hal_ll_adc_handle != NULL ) {
        hal_ll_adc_hw_specifics_map_local->vref_value = vref_value;
    }
}

hal_ll_err_t hal_ll_adc_read( handle_t *handle, uint16_t *readDatabuf )
{
    static uint32_t *reg;
    hal_ll_adc_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_adc_get_module_state_address);
    low_level_handle = hal_ll_adc_get_handle;
    hal_ll_base_addr_t *base = ( hal_ll_base_addr_t * )hal_ll_adc_hw_specifics_map_local->base ;

    if( low_level_handle->hal_ll_adc_handle == NULL ) {
        return HAL_LL_MODULE_ERROR;
    }

    // Preselect channel.
    *( base + HAL_LL_ADC_PCSEL_OFFSET ) |= 1ul << hal_ll_adc_hw_specifics_map_local->channel;
    // First conversion in regular sequence.
    *( base + HAL_LL_ADC_SQR1_OFFSET )  |= ( uint32_t )( hal_ll_adc_hw_specifics_map_local->channel ) << HAL_LL_ADC_FIRST_CONV;
    // Second conversion in regular sequence.
    *( base + HAL_LL_ADC_SQR1_OFFSET )  |= ( uint32_t )( hal_ll_adc_hw_specifics_map_local->channel ) << HAL_LL_ADC_SECOND_CONV;
    // Third conversion in regular sequence.
    *( base + HAL_LL_ADC_SQR1_OFFSET )  |= ( uint32_t )( hal_ll_adc_hw_specifics_map_local->channel ) << HAL_LL_ADC_THIRD_CONV;
    // Fourth conversion in regular sequence.
    *( base + HAL_LL_ADC_SQR1_OFFSET )  |= ( uint32_t )( hal_ll_adc_hw_specifics_map_local->channel ) << HAL_LL_ADC_FOURTH_CONV;
    // Start of regular conversion.
    *( base + HAL_LL_ADC_CR_OFFSET )    |= HAL_LL_ADC_CR_ADSTART;

    // The application should allow a delay of tSTAB between power up and start of conversion
    Delay_1us();

    // Wait until end of sampling phase is reached.
    while ( !( *( base + HAL_LL_ADC_ISR_OFFSET ) & HAL_LL_ADC_ISR_EOSMP ) );

    do
    {
        // Read conversion result from the last converted regular channel.
        reg = ( *( base + HAL_LL_ADC_DR_OFFSET ) );
    } while ( *( base + HAL_LL_ADC_ISR_OFFSET ) & HAL_LL_ADC_ISR_EOC );
    // Wait for EOC = 0.
    // It is cleared by software writing 1 to it or by reading the ADC_DR.
    *readDatabuf = reg;

    return HAL_LL_ADC_SUCCESS;
}

void hal_ll_adc_close( handle_t *handle )
{
    hal_ll_adc_hw_specifics_map_t *hal_ll_adc_hw_specifics_map_local = hal_ll_get_specifics(hal_ll_adc_get_module_state_address);
    low_level_handle = hal_ll_adc_get_handle;

    if( hal_ll_adc_hw_specifics_map_local->base != HAL_LL_MODULE_ERROR ) {

        hal_ll_adc_hw_specifics_map_local->vref_input = HAL_LL_ADC_VREF_DEFAULT;
        hal_ll_adc_hw_specifics_map_local->vref_value = 0;
        hal_ll_adc_hw_specifics_map_local->resolution = HAL_LL_ADC_RESOLUTION_12_BIT;

        low_level_handle->hal_ll_adc_handle = NULL;

        low_level_handle->init_ll_state = false;

        hal_ll_adc_hw_specifics_map_local->pin = HAL_LL_PIN_NC;
    }
}

// ----------------------------------------------- PRIVATE FUNCTION DEFINITIONS
static hal_ll_pin_name_t hal_ll_adc_check_pins( hal_ll_pin_name_t pin, uint8_t *index )
{
    uint16_t     adc_map_size;
    uint16_t     pin_index = 0;
    adc_map_size = ( sizeof( _adc_map ) / sizeof( hal_ll_adc_pin_map_t ) );

    if ( pin == HAL_LL_PIN_NC )
    {
        return HAL_LL_PIN_NC;
    }

    for ( pin_index = 0; pin_index < adc_map_size; pin_index++ )
        {
            if ( pin == _adc_map[pin_index]->pin )
            {
                *index = pin_index;
                return _adc_map[ pin_index ]->module_index;
            }
        }
    return HAL_LL_PIN_NC;
}

static void hal_ll_adc_map_pin( uint8_t module_index, uint8_t *index ) {
    // Map new pins
    hal_ll_adc_hw_specifics_map[module_index]->pin = _adc_map[*index ]->pin;
    hal_ll_adc_hw_specifics_map[module_index]->channel = _adc_map[*index ]->channel;
}

static hal_ll_adc_hw_specifics_map_t *hal_ll_get_specifics( handle_t handle ) {
    uint8_t hal_ll_module_count = sizeof(hal_ll_module_state) / (sizeof(hal_ll_adc_handle_register_t));
    static uint8_t hal_ll_module_error = hal_ll_module_count;

    while( hal_ll_module_count-- ) {
        if (hal_ll_adc_get_base_from_hal_handle == hal_ll_adc_hw_specifics_map[hal_ll_module_count]->base) {
            return &hal_ll_adc_hw_specifics_map[hal_ll_module_count];
        }
    }

    return &hal_ll_adc_hw_specifics_map[hal_ll_module_error];
}

static inline void adc12_enable_clock()
{
	set_reg_bit( _RCC_AHB1ENR, HAL_LL_ADC12_ENABLE_CLOCK );
}

static inline void adc3_enable_clock()
{
	set_reg_bit( _RCC_AHB4ENR, HAL_LL_ADC3_ENABLE_CLOCK );
}

static void _hal_ll_adc_enable_clock( hal_ll_base_addr_t *base )
{
    switch ( (uint32_t )base )
    {
        #ifdef ADC_MODULE_1
        case ( hal_ll_adc_module_num(ADC_MODULE_1) ):
            adc12_enable_clock();
            break;
        #endif
        #ifdef ADC_MODULE_2
        case ( hal_ll_adc_module_num(ADC_MODULE_2) ):
            adc12_enable_clock();
            break;
        #endif
        #ifdef ADC_MODULE_3
        case ( hal_ll_adc_module_num(ADC_MODULE_3) ):
            adc3_enable_clock();
            break;
        #endif
    }
}

